web service/exemplos/addDocument.txt


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://ama.pt/wsdl" xmlns:lar="http://pi.ama.pt/largefiles">
   <soapenv:Header/>
   <soapenv:Body>
      <wsdl:addDocument>
 
         <addDocumentInput>
            <UserAuthentication>
               <EntityNif>[NIF]</EntityNif>
               <Username>[UTILIZADOR]</Username>
               <Password[PASSWORD]</Password>
            </UserAuthentication>
            <DocumentToAdd>
               <Filename>[NOME_FICHEIRO.[EXTENSÃO]</Filename>
               <MimeType>[MIMETYPE]</MimeType>
             
            </DocumentToAdd>
            <lar:AttachContext>
               <!--Optional:-->
              
               <FileGuid>[GUID LARGEFILES]</FileGuid>
            </lar:AttachContext>
         </addDocumentInput>
      </wsdl:addDocument>
   </soapenv:Body>
</soapenv:Envelope>